[
    {
	"id": "1",
	"vehicle": "1"
	"dtc": "none",
	"timestamp": "20140116T152440+0000",
	"title": "60,000 Mileage Maintenance",
	"message": "Replace brake pads and brake fluid, radiaor hoses, coolant, power steering fluid, and timing belt. Inspect HVAC, suspension components, and tires.",
	"icon": "https://s3.amazonaws.com/k-mycloud/b16x55/maintenance.png",
"action": "https://joinfuse.com/some/action/url.html"
    },
    {
	"id": "2",
	"vehicle": "1",
	"dtc": "P0141",
	"timestamp": "20140114T152440+0000",
	"title": "Sensor 4 O2 Voltage  and Current Got Lower",
	"message": "",
	"meaning": "This code means that the heated circuit in the oxygen sensor on bank 1 decreases time needed to enter closed loop. As the O2 heater reaches operating temperature, the oxygen sensor responds by switching according to oxygen content of the exhaust surrounding it. The ECM tracks how long it takes for the oxygen sensor to begin switching. It the ECM determines (based on coolant temp) that too much time elapsed before the oxygen sensor began operating properly, it will set P0141."
	"symptoms": "You will likely notice poor fuel economy the illumination of the Check Engine Light.",
	"causes": "A code P0141 may mean that one or more of the following has happened: open or short to ground in the wiring harness O2 heater circuit wiring high resistance O2 heater element resistance is high Internal short or open in the heater element Note: Typically a failed catalytic converter does not cause this code.",
	"possible solutions": ["Replace oxygen sensor (cannot repair open or short that occurs internally to sensor)", 
			       "Repair short or open or high resistance in wiring harness or harness connectors"
			      ],
	"icon": "https://s3.amazonaws.com/k-mycloud/b16x55/maintenance.png",
        "action": "https://joinfuse.com/some/action/url.html"

    }, 
    {
	"id": "3",
	"vehicle": "1"
	"dtc": "none",
	"timestamp": "20140116T152440+0000",
	"title": "Fuel Low",
	"message": "You have less than 20% fuel remaining.",
	"icon": "https://s3.amazonaws.com/k-mycloud/b16x55/maintenance.png",
	"action": "https://joinfuse.com/some/action/url.html"
    },   
]
